{"id":"cdc_chest_pain_01","text":"Chest pain with pressure, squeezing, or crushing sensation especially with radiation to arm, jaw, neck, or back requires immediate evaluation. Associated symptoms include shortness of breath, nausea, sweating, or dizziness. These signs may indicate heart attack, aortic dissection, or pulmonary embolism. Call 911 immediately - do not drive yourself. If not allergic, chew aspirin while waiting for emergency services.","source_name":"CDC","source_url":"https://www.cdc.gov/heartdisease/heart_attack.htm","category":"red_flag","tags":["chest pain","heart attack","emergency","shortness of breath"],"age_group":"adult"}

{"id":"nhs_breathing_01","text":"Sudden severe shortness of breath, especially after travel, surgery, or prolonged immobility may indicate pulmonary embolism. Difficulty speaking in full sentences, blue lips or fingernails, or gasping for air requires immediate emergency care. Gradual onset over days may suggest heart failure, pneumonia, or asthma exacerbation. Any breathing difficulty with chest pain is a medical emergency.","source_name":"NHS","source_url":"https://www.nhs.uk/conditions/shortness-of-breath/","category":"red_flag","tags":["shortness of breath","pulmonary embolism","emergency","breathing"],"age_group":"adult"}

{"id":"who_stroke_01","text":"FAST signs of stroke: Face drooping (ask person to smile, check if one side droops), Arms weakness (ask person to raise both arms, one drifts down), Speech difficulty (slurred, strange words, confusion), Time to call emergency services immediately. Additional signs include sudden severe headache, sudden vision loss, sudden loss of balance or coordination. Every minute matters in stroke treatment.","source_name":"WHO","source_url":"https://www.who.int/news-room/fact-sheets/detail/the-top-10-causes-of-death","category":"red_flag","tags":["stroke","FAST","neurological","emergency"],"age_group":"adult"}

{"id":"cdc_severe_bleeding_01","text":"Severe bleeding that soaks through bandage in minutes, spurting blood, or bleeding that won't stop after 10-15 minutes of direct pressure requires emergency care. Apply firm direct pressure with clean cloth, elevate injured area above heart if possible, do not remove embedded objects. Call 911 for arterial bleeding, large wounds, or bleeding with signs of shock (pale, weak pulse, confusion).","source_name":"CDC","source_url":"https://www.cdc.gov/disasters/firstaid.html","category":"red_flag","tags":["bleeding","trauma","emergency","first aid"],"age_group":"all"}

{"id":"aap_infant_fever_01","text":"Fever in infants under 3 months (temperature 100.4째F/38째C or higher) requires immediate medical evaluation as immune systems are immature and serious infections can progress rapidly. For infants 3-6 months, fever over 102째F warrants urgent care. Always measure temperature rectally in infants. Signs requiring emergency care include lethargy, poor feeding, inconsolable crying, rash, difficulty breathing, or blue lips.","source_name":"AAP","source_url":"https://www.healthychildren.org/English/health-issues/conditions/fever/Pages/default.aspx","category":"red_flag","tags":["fever","infant","pediatric","emergency"],"age_group":"child"}

{"id":"nhs_self_care_cold_01","text":"Common cold symptoms include runny nose, sneezing, mild cough, sore throat, and low-grade fever. Most colds resolve in 7-10 days without treatment. Home care includes rest, fluids, honey for cough (not for infants under 1 year), saline nasal rinses, and pain relievers for adults. Seek medical care if fever exceeds 103째F, symptoms worsen after day 7, severe headache, or difficulty breathing develops.","source_name":"NHS","source_url":"https://www.nhs.uk/conditions/common-cold/","category":"self_care","tags":["cold","cough","self care","fever"],"age_group":"all"}

{"id":"mayo_headache_self_care_01","text":"Tension headaches are most common, presenting as band-like pressure around head. Self-care includes rest in quiet dark room, cold or warm compress, adequate hydration, regular sleep schedule, stress management, and over-the-counter pain relievers (follow package directions). Seek medical care for sudden severe headache, headache with fever and stiff neck, changes in vision, or headaches that worsen or become more frequent.","source_name":"Mayo Clinic","source_url":"https://www.mayoclinic.org/diseases-conditions/tension-headache/symptoms-causes/syc-20353977","category":"self_care","tags":["headache","tension","self care","stress"],"age_group":"adult"}

{"id":"cdc_appointment_back_pain_01","text":"Most back pain improves within 2-4 weeks with conservative care including rest, gentle movement, heat/cold therapy, and over-the-counter pain medication. Schedule medical appointment if pain persists beyond 4 weeks, radiates down leg below knee, causes numbness or tingling in legs, or follows significant injury. Immediate care needed for back pain with loss of bowel/bladder control, severe leg weakness, or following major trauma.","source_name":"CDC","source_url":"https://www.cdc.gov/arthritis/basics/back-pain.html","category":"appointment","tags":["back pain","chronic pain","appointment"],"age_group":"adult"}

{"id":"nhs_appointment_persistent_cough_01","text":"Cough lasting more than 3 weeks warrants medical evaluation to rule out underlying conditions. Most acute coughs from viral infections resolve in 2-3 weeks. Schedule appointment for persistent cough, especially with blood in sputum, unexplained weight loss, night sweats, or in smokers over 40. Immediate care needed for cough with severe breathing difficulty, high fever, or coughing up significant blood.","source_name":"NHS","source_url":"https://www.nhs.uk/conditions/cough/","category":"appointment","tags":["persistent cough","chronic cough","appointment"],"age_group":"adult"}