{"id":"emergency_chest_pain_01","text":"Chest pain with pressure, crushing, or squeezing sensation, especially with radiation to arm, jaw, neck, or back requires immediate evaluation. Associated symptoms include shortness of breath, nausea, sweating, dizziness. May indicate heart attack, aortic dissection, or pulmonary embolism. Call 911 immediately. Do not drive yourself.","source_name":"CDC","source_url":"https://www.cdc.gov/heartdisease/heart_attack.htm","category":"red_flag","tags":["chest pain","heart attack","emergency","severe pain"]}
{"id":"emergency_breathing_01","text":"Sudden severe shortness of breath, especially after travel, surgery, or prolonged immobility may indicate pulmonary embolism. Difficulty speaking in full sentences, blue lips or fingernails, or gasping for air requires immediate emergency care. Any breathing difficulty with chest pain is a medical emergency.","source_name":"NHS","source_url":"https://www.nhs.uk/conditions/shortness-of-breath/","category":"red_flag","tags":["shortness of breath","pulmonary embolism","emergency","breathing difficulty"]}
{"id":"emergency_severe_abdominal_01","text":"Severe abdominal pain with rigidity, guarding, or rebound tenderness may indicate surgical emergency such as appendicitis, bowel obstruction, or perforation. Sudden onset severe abdominal pain, especially with vomiting, fever, or inability to pass gas requires immediate evaluation. Call 911 for severe abdominal pain with signs of shock.","source_name":"Mayo Clinic","source_url":"https://www.mayoclinic.org/diseases-conditions/abdominal-pain/","category":"red_flag","tags":["severe abdominal pain","stomach pain","surgical emergency","appendicitis"]}
{"id":"emergency_stroke_01","text":"FAST signs of stroke: Face drooping, Arms weakness, Speech difficulty, Time to call emergency services immediately. Additional signs include sudden severe headache, sudden vision loss, sudden loss of balance or coordination. Every minute matters in stroke treatment. Call 911 immediately for any stroke symptoms.","source_name":"WHO","source_url":"https://www.who.int/news-room/fact-sheets/detail/stroke","category":"red_flag","tags":["stroke","FAST","neurological","emergency","sudden headache"]}
{"id":"emergency_severe_bleeding_01","text":"Severe bleeding that soaks through bandage in minutes, spurting blood, or bleeding that won't stop after 10-15 minutes of direct pressure requires emergency care. Apply firm direct pressure with clean cloth, elevate injured area above heart if possible. Call 911 for arterial bleeding, large wounds, or bleeding with signs of shock.","source_name":"CDC","source_url":"https://www.cdc.gov/disasters/firstaid.html","category":"red_flag","tags":["bleeding","trauma","emergency","severe bleeding"]}
{"id":"self_care_mild_headache_01","text":"Mild tension headaches can be managed with rest in quiet, dark room, adequate hydration, cold or warm compress to head, and over-the-counter pain relievers following package directions. Maintain regular sleep schedule and manage stress. Seek medical care for sudden severe headache, headache with fever and stiff neck, or vision changes.","source_name":"Mayo Clinic","source_url":"https://www.mayoclinic.org/diseases-conditions/tension-headache/","category":"self_care","tags":["mild headache","tension headache","self care","stress headache"]}
{"id":"self_care_common_cold_01","text":"Common cold symptoms include runny nose, sneezing, mild cough, sore throat, and low-grade fever. Most colds resolve in 7-10 days without treatment. Home care includes rest, fluids, honey for cough (not for infants under 1 year), saline nasal rinses, and pain relievers for adults. Seek medical care if fever exceeds 103°F or symptoms worsen after day 7.","source_name":"NHS","source_url":"https://www.nhs.uk/conditions/common-cold/","category":"self_care","tags":["cold","cough","runny nose","sore throat","mild fever"]}
{"id":"self_care_mild_sore_throat_01","text":"For mild sore throat without red flags, home care may include rest, warm fluids, salt-water gargles, and over-the-counter pain relievers as labeled. Throat lozenges and humidified air may help. Seek care if sore throat lasts beyond 7 days, fever persists for more than 3 days, severe pain, trouble swallowing, or symptoms worsen.","source_name":"NHS","source_url":"https://www.nhs.uk/conditions/sore-throat/","category":"self_care","tags":["sore throat","mild pain","gargle","throat pain"]}
{"id":"self_care_minor_cuts_01","text":"Minor cuts and scrapes can be treated at home with proper first aid. Clean hands, stop bleeding with direct pressure, clean wound with water, apply antibiotic ointment if available, cover with bandage. Watch for signs of infection: increased pain, redness, swelling, warmth, pus, or red streaking. Change bandage daily and keep wound clean and dry.","source_name":"Mayo Clinic","source_url":"https://www.mayoclinic.org/first-aid/first-aid-cuts/","category":"self_care","tags":["cuts","wounds","minor injury","first aid"]}
{"id":"self_care_mild_stomach_upset_01","text":"Mild stomach upset, nausea, or diarrhea from dietary indiscretion can often be managed with clear fluids, bland diet (BRAT: bananas, rice, applesauce, toast), and rest. Avoid dairy, caffeine, alcohol, fatty foods. Stay hydrated with small frequent sips. Seek care if severe dehydration, blood in stool, high fever, or symptoms persist beyond 3 days.","source_name":"CDC","source_url":"https://www.cdc.gov/foodsafety/symptoms.html","category":"self_care","tags":["mild stomach pain","nausea","diarrhea","upset stomach","food poisoning"]}
{"id":"appointment_chronic_back_pain_01","text":"Back pain lasting more than 4-6 weeks, recurring episodes, or pain interfering with daily activities may require non-urgent medical evaluation. Document pain triggers, timing, intensity, and what helps or worsens symptoms. Seek urgent care if accompanied by fever, numbness in groin area, new weakness in legs, or loss of bladder/bowel control.","source_name":"NHS","source_url":"https://www.nhs.uk/conditions/back-pain/","category":"appointment","tags":["back pain","chronic pain","persistent pain","recurring pain"]}
{"id":"appointment_persistent_cough_01","text":"Cough lasting more than 3 weeks warrants medical evaluation to rule out underlying conditions. Most acute coughs from viral infections resolve in 2-3 weeks. Schedule appointment for persistent cough, especially with blood in sputum, unexplained weight loss, night sweats, or in smokers over 40. Immediate care needed for cough with severe breathing difficulty.","source_name":"NHS","source_url":"https://www.nhs.uk/conditions/cough/","category":"appointment","tags":["persistent cough","chronic cough","lasting cough","weeks of cough"]}
{"id":"appointment_recurring_headaches_01","text":"Recurring headaches, changes in headache pattern, or headaches that interfere with daily life should be evaluated by healthcare provider. Keep headache diary noting triggers, timing, severity, associated symptoms. Schedule appointment for headaches occurring more than 15 days per month, or significant change in headache pattern.","source_name":"Mayo Clinic","source_url":"https://www.mayoclinic.org/diseases-conditions/chronic-daily-headaches/","category":"appointment","tags":["recurring headaches","chronic headaches","headache pattern","frequent headaches"]}
{"id":"appointment_skin_changes_01","text":"New or changing moles, skin lesions that don't heal within 2-3 weeks, or unusual skin changes should be evaluated by healthcare provider. Document size, color, shape changes with photos if possible. Schedule dermatology appointment for suspicious lesions, especially those that are asymmetric, have irregular borders, color variation, or diameter larger than pencil eraser.","source_name":"AAD","source_url":"https://www.aad.org/public/diseases/skin-cancer/","category":"appointment","tags":["skin changes","moles","skin lesions","dermatology"]}
{"id":"non_medical_detection_01","text":"This appears to be a non-medical query. I am designed specifically to help with health symptoms and medical concerns. Please describe any physical symptoms, pain, discomfort, or health-related concerns you may have. Examples include headaches, stomach pain, cough, fever, or other changes in how you feel physically.","source_name":"System","source_url":"","category":"non_medical","tags":["non medical","general question","not health related"]}